---
kind: method
id: M:Autodesk.Revit.DB.ValueAtPointBase.ClearAllFlags
source: html/95bc440a-e3dd-6b17-3843-e8cf451347b1.htm
---
# Autodesk.Revit.DB.ValueAtPointBase.ClearAllFlags Method

Sets flags for all measurements to ValueAtPointFlags::None.

## Syntax (C#)
```csharp
public void ClearAllFlags()
```